#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage{multirow}
#+PROPERTY: header-args:latex+ :packages '(("" "tikz"))
#+PROPERTY: header-args:latex+ :imagemagick yes :fit yes

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/readtheorg/js/readtheorg.js"></script>

#+FILETAGS: :paper_read:

**** Identity Mapping by Shortcuts
The paper adopt residual learning to every few stacked layers. A building block is defined as: Here $x$ and $y$ are the input and output vectors of the layers considered. The function $F(x,\{W_{i}\})$ represents the residual mapping to be learned.

<<Eqn.(1)>>
#+BEGIN_SRC latex :results raw :exports none
  \begin{equation}
  \label{eq:1}
  y = F(x,\{W_{i}\}+x).
  \end{equation}
#+END_SRC
#+RESULTS:
\begin{equation}
\label{eq:1}
y = F(x,\{W_{i}\}+x).
\end{equation}

*The dimensions of $x$ and $F$ must be equal*, If this is not the case(e.g., when changing the input/output channels), we can perform a linear projection $W_{s}$ by the shortcut connections to match the dimensions:

<<Eqn.(2)>>
#+BEGIN_SRC latex :results raw :exports none
\begin{equation}
\label{eq:2}
y=F(x,\{W_{i}\})+W_{s}x
\end{equation}
#+END_SRC

#+RESULTS:
\begin{equation}
\label{eq:2}
y=F(x,\{W_{i}\})+W_{s}x
\end{equation}

